package ch02;

public class ch02_리터럴 {
    // 논리형 false, true
    // 정수형, 실수형이 타입이 여러개, 접미사를 붙여 구별
    // 정수형은 l(long) 한개
    // 실수형은 F(float), d(double) 두 개임.
    // 문자형 '' 작은 따옴표 단일
    // 문자형 "" 큰 따옴표 문자 두 개 이상.
    // 하나의 문자로 큰 따옴표 가능한데 하나의 문자도
    // 큰 따옴표로 묶으면 문자열이 됨.
    // boolean power = ture; <- 논리형이랑 true false 가능
    // char ch = 'A';
    // String str = "ABC";
    // byte B = 127; <- int 타입
    // byte b = 128; // 에러 127을 벗어낫기 때문.
    // int i 100; // 접두사 없으니 10진수
    // int oct = 0100; // 0이 앞에 붙어서 8진수
    // int hex = 0x100; // 16진수
    // 접미사 접두사는 대소문자 구분하지 않아.
    // 실수형 f,d 두 개 있음.
    // float f = 3.14f; <- f 생략 불가
    // double d = 3.14d; <- d 생략 가능.
    // 1e3 = 10의 3승 1000.0d -- 실수형 접미사 없으면 d타입
    // .10 - 0.10 과 같은 타입

}
