package ch06객체지향언어;

public class CH06_02클래스와객체 {
    // 클래스의 정의 - 클래스란 객체를 정의해 놓은 것.
    // 클래스의 용도 - 클래스는 객체를 생성하는데 사용.

    // 객체의 정의 - 실제로 존재하는 것. 사물 또는 개념
    // 객체의 용도 - 객체가 가지고 있는 기능과 속성에 따라 다름.

    // 클래스 제품 설계도 // 객체 제품
    // 클래스 TV 설계도 // 객체 TV
    // 클래스 붕어빵기계 // 붕어빵

    // 객체를 만들기 위해 클래스를 만드는 것이다.

    // 객체지향 개념 -- 군대 때문에 만들어졌음
    // 실제 세계를 어떻게하면 컴퓨터 안으로 옮겨놓을까?
    // 미사일을 발사할 때 시뮬레이션 같은 것들을..
    // 실제 세계를 소프트웨어로 만들어 컴퓨터 안에서 실행하게 하는 것.
    // 하드웨어를 소프트웨어로 바꾸는 작업이 객체지향인 것이다.
    // 하드웨어를 분석해 속성과 기능으로 나눠

    // 속성은 변수로 기능은 메서드로 바꾸면 tv 클래스 만들어짐.

   // 속성 -- 크기, 길이, 높이 ,색상 볼륨, 채널 등.
    // 기능 -- 켜기 끄기 ,볼륨 높이기 등등..

    // class Tv {  // TV 클래스이면서 TV 설계도이다.
    // string color: // 색깔
    // boolean power; // 전원상태
    // int channel; // 채널

    // void power()
    // void channelUp()
    // void channelDown()
}
