package ch06객체지향언어;

public class ch06_14매서드란 {
    // 매서드란?
    // 1. 문장들을 묶어놓은 것.
    // -- 작업단위로 문장들을 묶어서 이름 붙인 것.
    // 2. 값(입력)을 받아서 처리하고, 결과를 반환(출력)

    // int(반환타입) add(변수이름)(int x, int y)[매개변수]
    // {int result = x+y;
    // return result; // 결과를 반환

    // 함수 : 상자 함, 수 -> 매서드와 함수는 같은 말임.
    // 매서드는 반드시 클래스 안에 있어야함.
    // 함수는 클래스에 독립적임.
    // 근본적으로는 같은 개념이야.
    // println("Hello world") <- 프린트엘엔같은 애들이 매서드임.

    // 6-14 매서드의 장점
    // 1. 코드의 중복을 줄일 수 있어.
    // 2. 코드의 관리가 쉽다
    // 3. 코드를 재사용할 수 있다
    // 4. 코드가 간결해서 이해하기 쉬워진다.

    // 코드의 중복은 반드시 제거해야함. // 게다가 간결함
    // 어떤 작업을 수행하는 지시 문장.
    // printArr(numArr); // 배열을 출력.
    //

}
