public class ch04_switch문 {
    // 처리해야 하는 경우의 수가 많을 때 유용한 조건문임.
    // if와 스위치문만 있음 조건문은

    //ex
    // swith (조건식) {
    // case 값1 : // 조건식의 결과가 값1과 같은 경우 수행될 문장들
    // case문 값에 해당하는 문장으로 이동함
    // case 값2 : // 조건식의 결과가 값2와 같은 경우 수행될 문장들
    // break; // 스위치문을 벗어남
    // 이 break; 문을 빼먹지 않도록 조심해야해.
    // default -- 조건식의 결과아 일치하는 case문이 없을 때 수행할 문장들.


    // 1. 조건식을 계산
    // 2. 조선식의 결과와 일치하는 case문으로 이동한다
    // 3. 이후의 문장들을 수행한다
    // 4. break문이나 swich문의 끝을 만나면 swich문 전체를 빠져나감다.
    //}

    // case만 계속 늘리면됨.

    // swich는 제약 조건이 있음
    // 1. swich문의 조건식 결과는 정수 또는 문자열이어야 함.
    // 2. case문의 값은 정수 상수(문자,포함), 문자열만 가능하며, 중복되지 않아야한다.

}
