package ch8;

public class ch08_프로그램오류 {
    // 1. 컴파일 에러 : 컴파일 할 때 터지는 에러
    // 2. 런타입 에러 : 실행 중 발생하는 에러
    //  1) 에러 - 프로그램 코드에 의해서 수습될 수 없는 심각한 오류
    //  2) 예외 - 프로그램 코드에 의해서 수습될 수 있는 미약한 오류
    // 3. 논리적 에러 : 작성 의도와 다르게 동작

    // 예외처리의 정의와 목적
    // 예외처리의 정의
    // 프로그램 실행 시 발생할 수 있는 예외의 발생에 대비한 코드르 작성하는 것.
    // 목적 프로그램의 비정상 종료를 막고 정상적인 실행상태를 유지하는 것.


    // javac.exe 자바 컴파일러
    // 자바 컴파일러 하는 일
    // 1. 구문체크
    // 2. 번역
    // 3. 최적화
    public static void main(String[] args) {
        System.out.println("nomunomu");
        // 런타임에러, 실행중 발생 - 넘어온 값이 없는데 띄우려니까 에러임.

    }
        // ㄴ 대분자로 써야하는데 소문자로 쓰면 컴파일에러남.
    }

